## 1. Reshaping Data

### 1-1. .melt() : 열 이름을 행 값으로, 즉 value로 보내는 메서드

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'A': {0: 'a', 1: 'b', 2: 'c'},
    'B': {0: 1, 1: 3, 2: 5},
    'C': {0: 2, 1: 4, 2: 6}
})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [3]:
pd.melt(df, id_vars=['A'], value_vars=['B'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5

In [5]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [4]:
pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])

   A variable  value
0  a        B      1
1  b        B      3
2  c        B      5
3  a        C      2
4  b        C      4
5  c        C      6

In [6]:
pd.melt(df, value_vars=['A', 'B', 'C'])

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

In [7]:
pd.melt(df, value_vars=['A', 'B', 'C']).rename(columns={'variable': '가', 'value': '값'})

   가  값
0  A  a
1  A  b
2  A  c
3  B  1
4  B  3
5  B  5
6  C  2
7  C  4
8  C  6

In [8]:
pew = pd.read_csv('./../data/pew.csv')
pew

,religion,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
0,Agnostic,27,34,60,81,76,137,122,109,84,96
1,Atheist,12,27,37,52,35,70,73,59,74,76
2,Buddhist,27,21,30,34,33,58,62,39,53,54
3,Catholic,418,617,732,670,638,1116,949,792,633,1489
4,Don’t know/refused,15,14,15,11,10,35,21,17,18,116
5,Evangelical Prot,575,869,1064,982,881,1486,949,723,414,1529
6,Hindu,1,9,7,9,11,34,47,48,54,37
7,Historically Black Prot,228,244,236,238,197,223,131,81,78,339
8,Jehovah's Witness,20,27,24,24,21,30,15,11,6,37
9,Jewish,19,19,25,25,30,95,69,87,151,162
10,Mainline Prot,289,495,619,655,651,1107,939,753,634,1328
11,Mormon,29,40,48,51,56,112,85,49,42,69
12,Muslim,6,7,9,10,9,23,16,8,6,22
13,Orthodox,13,17,23,32,32,47,38,42,46,73
14,Other Christian,9,7,11,13,13,14,18,14,12,18
15,Other Faiths,20,33,40,46,49,63,46,40,41,71
16,Other World Religions,5,2,3,4,2,7,3,4,4,8
17,Unaffiliated,217,299,374,365,341,528,407,321,258,597

In [9]:
pew2 = pd.melt(pew, id_vars='religion')
pew2

                  religion            variable  value
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [10]:
pew2.iloc[[0, 1, 2, 18, 19, 20], :]

    religion variable  value
0   Agnostic    <$10k     27
1    Atheist    <$10k     12
2   Buddhist    <$10k     27
18  Agnostic  $10-20k     34
19   Atheist  $10-20k     27
20  Buddhist  $10-20k     21

In [11]:
pew3 = pd.melt(pew, id_vars='religion', var_name='income', value_name='count')
pew3

                  religion              income  count
0                 Agnostic               <$10k     27
1                  Atheist               <$10k     12
2                 Buddhist               <$10k     27
3                 Catholic               <$10k    418
4       Don’t know/refused               <$10k     15
..                     ...                 ...    ...
175               Orthodox  Don't know/refused     73
176        Other Christian  Don't know/refused     18
177           Other Faiths  Don't know/refused     71
178  Other World Religions  Don't know/refused      8
179           Unaffiliated  Don't know/refused    597

[180 rows x 3 columns]

In [12]:
billb = pd.read_csv('./../data/billboard.csv')
billb

,year,artist,track,time,date.entered,wk1,wk2,wk3,wk4,wk5,...,wk67,wk68,wk69,wk70,wk71,wk72,wk73,wk74,wk75,wk76
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,87,82.0,72.0,77.0,87.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,91,87.0,92.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,81,70.0,68.0,67.0,66.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,3 Doors Down,Loser,4:24,2000-10-21,76,76.0,72.0,69.0,67.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,57,34.0,25.0,17.0,17.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
312,2000,Yankee Grey,Another Nine Minutes,3:10,2000-04-29,86,83.0,77.0,74.0,83.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
313,2000,"Yearwood, Trisha",Real Live Woman,3:55,2000-04-01,85,83.0,83.0,82.0,81.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
314,2000,Ying Yang Twins,Whistle While You Tw...,4:19,2000-03-18,95,94.0,91.0,85.0,84.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
315,2000,Zombie Nation,Kernkraft 400,3:30,2000-09-02,99,99.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
316,2000,matchbox twenty,Bent,4:12,2000-04-29,60,37.0,29.0,24.0,22.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
billb2 = pd.melt(billb, id_vars=['year', 'artist', 'track', 'time', 'date.entered'],
                 var_name='week', value_name='rationg')
billb2.head()

,year,artist,track,time,date.entered,week,rationg
0,2000,2 Pac,Baby Don't Cry (Keep...,4:22,2000-02-26,wk1,87.0
1,2000,2Ge+her,The Hardest Part Of ...,3:15,2000-09-02,wk1,91.0
2,2000,3 Doors Down,Kryptonite,3:53,2000-04-08,wk1,81.0
3,2000,3 Doors Down,Loser,4:24,2000-10-21,wk1,76.0
4,2000,504 Boyz,Wobble Wobble,3:35,2000-04-15,wk1,57.0

In [15]:
# .pivot() : 기존의 데이터프레임을 이용, 지정한 행과 열 기준으로 데이터를 배치하는 메서드
df2 = pd.DataFrame({
    'foo': ['one', 'one', 'one', 'two', 'two', 'two'],
    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    'baz': [1, 2, 3, 4, 5, 6]
})

df2

   foo bar  baz
0  one   A    1
1  one   B    2
2  one   C    3
3  two   A    4
4  two   B    5
5  two   C    6

In [16]:
ef = df2.pivot(index='foo', columns='bar', values='baz')
ef

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [17]:
ef.columns

Index(['A', 'B', 'C'], dtype='object', name='bar')

In [18]:
ef.columns.name

'bar'

In [19]:
ef.index

Index(['one', 'two'], dtype='object', name='foo')

In [20]:
ef.index.name

'foo'

In [21]:
# join() - index를 기준으로 데이터 세트를 합쳐 주는 메서드
import numpy as np

In [22]:
dfa = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                   index=['a', 'c', 'e'], columns=['Ohio', 'Nevada'])
dfa

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [23]:
dfb = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
                   index=['e', 'c', 'd', 'b'], columns=['Misouri', 'Alabama'])
dfb

   Misouri  Alabama
e      7.0      8.0
c      9.0     10.0
d     11.0     12.0
b     13.0     14.0

In [25]:
join1 = dfa.join(dfb, how='outer')
join1

   Ohio  Nevada  Misouri  Alabama
a   1.0     2.0      NaN      NaN
b   NaN     NaN     13.0     14.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
e   5.0     6.0      7.0      8.0

In [26]:
join2 = dfa.join(dfb, how='inner')
join2

   Ohio  Nevada  Misouri  Alabama
c   3.0     4.0      9.0     10.0
e   5.0     6.0      7.0      8.0

In [27]:
join3 = dfa.join(dfb, how='left')
join3

   Ohio  Nevada  Misouri  Alabama
a   1.0     2.0      NaN      NaN
c   3.0     4.0      9.0     10.0
e   5.0     6.0      7.0      8.0

In [28]:
join4 = dfa.join(dfb, how='right')
join4

   Ohio  Nevada  Misouri  Alabama
e   5.0     6.0      7.0      8.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
b   NaN     NaN     13.0     14.0

In [29]:
join5 = dfa.join(dfb, how='right', sort=True)
join5

   Ohio  Nevada  Misouri  Alabama
b   NaN     NaN     13.0     14.0
c   3.0     4.0      9.0     10.0
d   NaN     NaN     11.0     12.0
e   5.0     6.0      7.0      8.0

In [30]:
# .concat() - 시리즈나 데이터프레임을 합쳐주는 메서드
s1 = pd.Series(['a', 'b'])
s1

0    a
1    b
dtype: object

In [31]:
s2 = pd.Series(['c', 'd'])
s2

0    c
1    d
dtype: object

In [32]:
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [33]:
pd.concat([s1, s2], ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [34]:
pd.concat([s1, s2], axis=0) # 행 기준 연결: 결과 시리즈

0    a
1    b
0    c
1    d
dtype: object

In [35]:
pd.concat([s1, s2], axis=1)

   0  1
0  a  c
1  b  d

In [36]:
dfc = pd.DataFrame([['a', 1], ['b', 2]],
                   columns=['letter', 'number'])
dfc

  letter  number
0      a       1
1      b       2

In [38]:
dfd = pd.DataFrame([['c', 3], ['d', 4]],
                   columns=['letter', 'number'])
dfd

  letter  number
0      c       3
1      d       4

In [39]:
pd.concat([dfc, dfd])

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [41]:
gf = pd.concat([dfc, dfd]).sort_index()
gf

  letter  number
0      a       1
0      c       3
1      b       2
1      d       4

In [42]:
ef = pd.concat([dfc, dfd]).reset_index()
ef

   index letter  number
0      0      a       1
1      1      b       2
2      0      c       3
3      1      d       4

In [43]:
ef = ef.drop(columns='index')
ef

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [45]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                   columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [50]:
pd.concat([dfc, df3], sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [49]:
dfc

  letter  number
0      a       1
1      b       2

In [51]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                   columns=['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [52]:
pd.concat([dfc, df4], axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [53]:
pd.concat([dfc, df4], axis=0)

  letter  number  animal    name
0      a     1.0     NaN     NaN
1      b     2.0     NaN     NaN
0    NaN     NaN    bird   polly
1    NaN     NaN  monkey  george

In [54]:
pd.concat([dfc, df4], axis=0, sort=True)

   animal letter    name  number
0     NaN      a     NaN     1.0
1     NaN      b     NaN     2.0
0    bird    NaN   polly     NaN
1  monkey    NaN  george     NaN

In [57]:
s3 = pd.concat([s1, s2], keys=['s1', 's2'])
s3

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [58]:
s3.index

MultiIndex([('s1', 0),
            ('s1', 1),
            ('s2', 0),
            ('s2', 1)],
           )

In [59]:
s3.keys()

MultiIndex([('s1', 0),
            ('s1', 1),
            ('s2', 0),
            ('s2', 1)],
           )

In [63]:
t = pd.concat([s1, s2], keys=['s1', 's2'], names=['Series name', 'Row ID'])
t

Series name  Row ID
s1           0         a
             1         b
s2           0         c
             1         d
dtype: object

In [66]:
t.index.names

FrozenList(['Series name', 'Row ID'])

In [70]:
df5 = pd.DataFrame([1], index=['a'])
df5

   0
a  1

In [71]:
df6 = pd.DataFrame([2], index=['a'])
df6

   0
a  2

In [72]:
pd.concat([df5, df6])

   0
a  1
a  2

In [73]:
pd.concat([df5, df6], verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['a'], dtype='object')

## 2. Combine Data Set

.merge() - 공통된 열을 기준으로 데이터 세트를 합침

In [74]:
adf = pd.DataFrame({
    'x1':['A', 'B', 'C'],
    'x2': [1, 2, 3]
}, index=[0, 1, 2])
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [75]:
bdf = pd.DataFrame({
    'x1':['A', 'B', 'D'],
    'x3': ['T', 'F',' T']
}, index=[0, 1, 2])
bdf

  x1  x3
0  A   T
1  B   F
2  D   T

In [76]:
pd.merge(adf, bdf, how='left', on='x1')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [77]:
pd.merge(adf, bdf, how='right', on='x1')

  x1   x2  x3
0  A  1.0   T
1  B  2.0   F
2  D  NaN   T

In [78]:
pd.merge(adf, bdf, how='inner', on='x1')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [79]:
pd.merge(adf, bdf, how='outer', on='x1')

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [80]:
bdf.x1

0    A
1    B
2    D
Name: x1, dtype: object

In [81]:
adf.x1.isin(bdf.x1)

0     True
1     True
2    False
Name: x1, dtype: bool

In [82]:
adf[adf.x1.isin(bdf.x1)]

  x1  x2
0  A   1
1  B   2

In [83]:
adf[~adf.x1.isin(bdf.x1)]

  x1  x2
2  C   3

In [84]:
pd.merge(adf, bdf, how='outer', indicator=True)

  x1   x2   x3      _merge
0  A  1.0    T        both
1  B  2.0    F        both
2  C  3.0  NaN   left_only
3  D  NaN    T  right_only

In [85]:
pd.merge(adf, bdf, how='outer', indicator=True).query('_merge == "right_only"')

  x1  x2  x3      _merge
3  D NaN   T  right_only

In [86]:
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [87]:
df['A'].apply(lambda x: x+'_1')

0    a_1
1    b_1
2    c_1
Name: A, dtype: object

In [88]:
df['A_1'] = df['A'].apply(lambda x: x+'_1')
df

   A  B  C  A_1
0  a  1  2  a_1
1  b  3  4  b_1
2  c  5  6  c_1

In [89]:
import seaborn as sns

In [90]:
df = sns.load_dataset('iris')
df

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [91]:
def smp(x):
    x = x[-3:]
    return x

In [92]:
df['species'].apply(smp)

0      osa
1      osa
2      osa
3      osa
4      osa
      ...
145    ica
146    ica
147    ica
148    ica
149    ica
Name: species, Length: 150, dtype: object

In [94]:
df['species-3'] = df['species'].apply(smp)
df

     sepal_length  sepal_width  petal_length  petal_width    species species-3
0             5.1          3.5           1.4          0.2     setosa       osa
1             4.9          3.0           1.4          0.2     setosa       osa
2             4.7          3.2           1.3          0.2     setosa       osa
3             4.6          3.1           1.5          0.2     setosa       osa
4             5.0          3.6           1.4          0.2     setosa       osa
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica       ica
146           6.3          2.5           5.0          1.9  virginica       ica
147           6.5          3.0           5.2          2.0  virginica       ica
148           6.2          3.4           5.4          2.3  virginica       ica
149           5.9          3.0           5.1          1.8  virginica       ica

[150 rows x 6 columns]

## 3. Group Data

.groupby() - 지정한 열을 각 그룹으로 만들어 각종 계산

In [95]:
df = sns.load_dataset('mpg')
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [96]:
df.groupby(by='origin').min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [97]:
df.groupby(by='origin')['cylinders'].mean()

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [98]:
df.groupby(['model_year', 'origin'])['cylinders'].median()

model_year  origin
70          europe    4.0
            japan     4.0
            usa       8.0
71          europe    4.0
            japan     4.0
            usa       6.0
72          europe    4.0
            japan     4.0
            usa       8.0
73          europe    4.0
            japan     4.0
            usa       8.0
74          europe    4.0
            japan     4.0
            usa       6.0
75          europe    4.0
            japan     4.0
            usa       6.0
76          europe    4.0
            japan     4.0
            usa       6.0
77          europe    4.0
            japan     4.0
            usa       6.0
78          europe    4.5
            japan     4.0
            usa       6.0
79          europe    4.0
            japan     4.0
            usa       6.0
80          europe    4.0
            japan     4.0
            usa       4.0
81          europe    4.0
            japan     4.0
            usa       4.0
82          europe    4.0
            japan     4.0
            usa       4.0
Name: cylinders, dtype: float64

In [99]:
pd.DataFrame(df.groupby(['model_year', 'origin'])['cylinders'].median())

                   cylinders
model_year origin
70         europe        4.0
           japan         4.0
           usa           8.0
71         europe        4.0
           japan         4.0
           usa           6.0
72         europe        4.0
           japan         4.0
           usa           8.0
73         europe        4.0
           japan         4.0
           usa           8.0
74         europe        4.0
           japan         4.0
           usa           6.0
75         europe        4.0
           japan         4.0
           usa           6.0
76         europe        4.0
           japan         4.0
           usa           6.0
77         europe        4.0
           japan         4.0
           usa           6.0
78         europe        4.5
           japan         4.0
           usa           6.0
79         europe        4.0
           japan         4.0
           usa           6.0
80         europe        4.0
           japan         4.0
           usa           4.0
81         europe        4.0
           japan         4.0
           usa           4.0
82         europe        4.0
           japan         4.0
           usa           4.0

In [101]:
pd.DataFrame(df.groupby(['origin', 'model_year'])['cylinders'].median())

                   cylinders
origin model_year
europe 70                4.0
       71                4.0
       72                4.0
       73                4.0
       74                4.0
       75                4.0
       76                4.0
       77                4.0
       78                4.5
       79                4.0
       80                4.0
       81                4.0
       82                4.0
japan  70                4.0
       71                4.0
       72                4.0
       73                4.0
       74                4.0
       75                4.0
       76                4.0
       77                4.0
       78                4.0
       79                4.0
       80                4.0
       81                4.0
       82                4.0
usa    70                8.0
       71                6.0
       72                8.0
       73                8.0
       74                6.0
       75                6.0
       76                6.0
       77                6.0
       78                6.0
       79                6.0
       80                4.0
       81                4.0
       82                4.0

In [102]:
df.pivot(index='origin', columns='model_year', values='cylinders')

ValueError: Index contains duplicate entries, cannot reshape

In [103]:
df.pivot_table(index='origin', columns='model_year', values='cylinders')

model_year,70,71,72,73,74,75,76,77,78,79,80,81,82
origin,,,,,,,,,,,,,
europe,4.000000,4.0,4.000000,4.000000,4.000000,4.0,4.250000,4.000000,4.833333,4.25000,4.111111,4.500000,4.0
japan,4.000000,4.0,3.800000,4.250000,4.000000,4.0,4.500000,4.166667,4.000000,4.00000,4.076923,4.333333,4.0
usa,7.636364,6.2,6.888889,7.241379,6.266667,6.4,6.363636,6.222222,6.000000,6.26087,4.285714,4.923077,4.3